Revit 2024 API
BendingDetailBendDiameterDimensionType Enumeration
 Describes the dimension type for bend diameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum BendingDetailBendDiameterDimensionType
Visual Basic
Public Enumeration BendingDetailBendDiameterDimensionType
Visual C++
public enum class BendingDetailBendDiameterDimensionType
Members
Member name | Description
Radial |  Radial Dimension Type
Diameter |  Diameter Dimension Type
See Also
Autodesk.Revit.DB.Structure Namespace